Tekla Open API Reference for Tekla Structures 2025
AngleDimensionAttributes.TriangleBase Property
 Gets or sets the triangle base length which controls the base dimension shown for bevel dimensions (only if Type is AngleTypes.Triangle).
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int TriangleBase { get; set; }
Public Property TriangleBase As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
AngleDimensionAttributes Class
Tekla.Structures.Drawing Namespace